// RESTful API:
// ●	CRUD систем за додавање на курсеви во база
// ●	Да се имплементира JWT автентикација
// ●	Курсот е дел од една академија, во која има повеќе курсеви
// ●	Да се отворат сите рути за менаџирање на ресурсот Курс
// ●	Да не се отвараат рути за менаџирање на академии
// ●	Само логиран корисник може да додава, брише или менаџира курс
// ●	Нелогирани корисници можат да ги прегледуваат сите курсеви или еден конкретен курс
// ●	Во вратените податоци од серверот за секој курс треба да биде вратена и академијата во која се предава со сите нејзини податоци, освен листа на курсеви кои се во неа

const express = require("express");
const { expressjwt: jwt } = require("express-jwt");

const api = express();